{
    "start": {
      "description": "Игрок просыпается в маленькой хижине. За окном слышится журчание реки. Открывая глаза, он видит старого мага — Гида, который склонился над своим древним свитком и что-то пишет. Гид замечает взгляд игрока и кивает.",
      "dialogs": [
          {
            "character": "Гид",
            "text": "Добро пожаловать, молодой ученик! Ты готов стать настоящим мастером программирования? В нашем мире программирование — это магия! Но прежде чем мы начнем, тебе нужно овладеть несколькими основными заклинаниями. Ты должен научиться правильно использовать синтаксис. Так ты сможешь взаимодействовать с этим миром.",
            "task": "start"
          },
          {
            "character": "Гид",
            "text": "Попробуй сказать что-то в ответ. Введи свое имя.",
            "task": "start"
          },
          {
            "character": "Гид",
            "text": "Ты только что использовал заклинание `input`. Это магия, которая позволяет тебе вводить текст в мир. Но чтобы это сработало, нужно правильно записывать заклинание. Если бы ты забыл скобки или кавычки, заклинание не сработало бы. Синтаксис — это основа всех заклинаний в нашем мире.",
            "task": "start"
          },
          {
            "character": "Гид",
            "text": "Теперь давай попробуем вывести твои слова другим заклинанием — `print`.",
            "task": "start"
          },
          {
            "character": "Гид",
            "text": "Попробуй теперь ввести что-нибудь, чтобы я мог это вывести на экран.",
            "task": "start"
          },
          {
            "character": "Гид",
            "text": "Вижу, ты освоил заклинание `input` и понял, как использовать `print`. Отлично! Запомни, всегда проверяй синтаксис, ведь магия работает только тогда, когда заклинания написаны правильно.",
            "task": "start"
          },
      ],
      "task": "Освой синтаксис заклинаний: используйте input и print.",
      
      "scenario": "Ты — Гид, старый маг, который приветствует игрока, рассказывает о мире, где магия — это программирование, и объясняет использование команд input и print для ввода и вывода данных.",
      "question": "Введи свое имя, чтобы продолжить.",
      "next": "bucket"
    },
    "bucket": {
      "description": "Гид подводит игрока к большому ведру у двери хижины, рядом с ручьем. Он берет палочку и указывает на ведро, рассказывая, что объекты в этом мире можно представлять как переменные.",
      "dialogs": [
        {
            "character": "Гид",
            "text": "Здесь ты будешь использовать переменные, чтобы взаимодействовать с предметами. Каждый объект в нашем мире можно представить как переменную. Давай начнем с ведра. Твое ведро будет пустым.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь давай попробуем наполнить его водой из реки. Вода будет переменной, а количество воды будет значением этой переменной.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь, когда ты увидел, как это работает, попробуй сам изменить количество воды. Сколько воды ты хочешь добавить в ведро?",
            
          },
          {
            "character": "Гид",
            "text": "Теперь в ведре 15 единиц воды! Ты успешно использовал переменные для изменения мира. Отлично!",
            
          }
      ],
      "task": "Используйте переменные для изменения мира. Наполните ведро водой, используя переменные.",
      "scenario": "Ты — Гид, который объясняет, как с помощью переменных можно изменить количество воды в ведре. Ты задаешь вопрос и показываешь пример с переменной 'water'.",
      "question": "Сколько воды ты хочешь добавить в ведро?",
      "next": "cycle"
    },
    "cycle": {
      "description": "Гид ведет игрока в лес, где стоит куча древесины рядом с костром. Он объясняет, что циклы — это магия для многократных действий.",
      "dialogs": [
        {
            "character": "Гид",
            "text": "Теперь ты готов использовать циклы. Это заклинания для повторяющихся действий. С их помощью ты сможешь выполнить множество однообразных задач. Давай попробуем сложить дрова в костер.",
            
          },
          {
            "character": "Гид",
            "text": "Каждый раз, когда ты кладешь дрова в костер, количество дров в рюкзаке уменьшается, а в костре увеличивается. Этот процесс повторяется, пока в костре не будет хотя бы 10 единиц древесины.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь, попробуй сам ввести новое количество древесины, которую ты хочешь добавить в костер. Сколько дров ты хочешь положить?",
            
          },
          {
            "character": "Гид",
            "text": "Ты выбрал 6. И теперь костер загорелся! Помни, что циклы позволяют выполнять одно и то же действие несколько раз, пока не будет достигнута цель.",
            
          }
      ],
      "task": "Используйте цикл для многократных действий.",
      "scenario": "Ты — Гид, который демонстрирует использование цикла while для многократного действия. Ты показываешь, как с помощью цикла положить дрова в костер и изменить их количество.",
      "question": "Сколько дров ты хочешь положить в костер?",
      "next": "if_condition"
    },
    "if_condition": {
      "description": "Игрок входит в лесную поляну и видит двух существ: гнома с усами и большого мохнатого зверя. Гид объясняет, как использовать условные операторы для принятия решений.",
      "dialogs": [
        {
            "character": "Гид",
            "text": "В нашем мире всегда нужно принимать решения. Посмотри на этих двух существ. Только один из них — твой друг, другой может напугать тебя. Чтобы понять, кто перед тобой, мы используем условные операторы. Давай я покажу тебе пример.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь ты видишь, что гном — твой друг, а зверь — это враг. Теперь попробуй сам выбрать, с кем ты хочешь поговорить. Введи 'gnome' или 'beast'.",
            
          },
          {
            "character": "Гид",
            "text": "Ты выбрал гнома! Он улыбается и кивает тебе. Условные операторы помогают нам делать выбор, основываясь на ситуации. Попробуй теперь другой выбор.",
            
          },
          {
            "character": "Гид",
            "text": "Это было мудрое решение! Условные операторы дают нам возможность принимать решения, что особенно важно в этом мире.",
            
          }
      ],
      "task": "Используйте условные операторы для выбора, с кем поговорить.",
      "scenario": "Ты — Гид, который объясняет использование оператора if для выбора действия. Ты демонстрируешь, как выбрать, с кем поговорить, в зависимости от введенного игроком значения ('gnome' или 'beast').",
      "question": "С кем ты хочешь поговорить? Введи 'gnome' или 'beast'.",
      "next": "function"
    },
    "function": {
      "description": "Гид подводит игрока к большому дубу, на ветке которого сидит белка с орехом. Он объясняет, как создавать собственные заклинания — функции.",
      "dialogs":[
        {
            "character": "Гид",
            "text": "Теперь настало время освоить создание собственных заклинаний — функций! Функции позволяют тебе создавать магию, которую можно использовать многократно. Давай создадим заклинание, чтобы попросить белку дать тебе орех.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь ты можешь использовать это заклинание каждый раз, когда хочешь. Попробуй создать свою функцию. Например, функция, которая скажет тебе привет.",
            
          },
          {
            "character": "Гид",
            "text": "Замечательно! Ты только что создал свою собственную магию. Функции позволяют нам повторно использовать заклинания, создавая настоящие магические инструменты.",
            
          }
      ],
      "task": "Создайте свою функцию для выполнения действий.",
      "scenario": "Ты — Гид, который объясняет, как создавать функции в мире магии. Ты даешь задание — создать функцию, которая будет приветствовать игрока по имени.",
      "question": "Создай функцию, которая скажет тебе привет.",
      "next": "list"
    },
    "list": {
      "description": "Гид ведет игрока к пруду, в котором плавают разноцветные лягушки. Он объясняет, как работать с несколькими объектами, используя списки.",
      "dialogs":[
        {
            "character": "Гид",
            "text": "Сейчас мы поработаем с несколькими объектами одновременно, используя списки. В этом пруду живут лягушки разных цветов. Мы можем записать их в список и управлять ими сразу. Давай создадим список.",
            
          },
          {
            "character": "Гид",
            "text": "Теперь ты видишь всех лягушек. Ты можешь изменить их, добавить или удалить из списка. Попробуй сам!",
            
          },
          {
            "character": "Гид",
            "text": "Теперь в пруду появилась еще одна лягушка. Ты добавил новую лягушку в список с помощью метода `append`. Мудро!",
            
          },
          {
            "character": "Гид",
            "text": "Ты проделал отличную работу, молодой ученик! Я горжусь твоими успехами. Но, как бы ни были увлекательны заклинания, твой путь только начинается. Программирование — это магия, и ты только раскрыл первые секреты этой силы. В мире много приключений и чудес, которые ждут тебя!",
            
          },
          {
            "character": "Гид",
            "text": "До встречи, друг! Удачи на твоем пути. Пусть магия программирования всегда будет с тобой. Прощай!",
            
          }
          
      ],
      "task": "Используйте список для работы с несколькими объектами.",
      "scenario": "Ты — Гид, который демонстрирует работу со списками в магическом мире. Ты показываешь, как добавить новую лягушку в список и вывести результат.",
      "question": "Добавь новую лягушку в список. Какую лягушку ты хочешь добавить?",
      "next": null
    }
  }
  